IDEA Open Model
CrossSection Class
Compatible with IDEA StatiCa Beta 20.0
 Cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.CrossSection.CrossSection
 IdeaRS.OpenModel.CrossSection.CrossSectionComponent
 IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed
 IdeaRS.OpenModel.CrossSection.CrossSectionParameter
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class CrossSection : OpenElementId
Public MustInherit Class CrossSection
	Inherits OpenElementId
The CrossSection type exposes the following members.
Constructors
Name | Description
CrossSection
 Constructor
Top
Properties
Name | Description
CrossSectionRotation
 Rotation of Cross - Section
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Name of cross-section
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace